###############################################################
#  Generated by:      Cadence Innovus 25.13-s088_1
#  OS:                Linux x86_64(Host ID vlsi.iitgn.ac.in)
#  Generated on:      Mon Jun  1 15:36:47 2026
#  Design:            riscv_top
#  Command:           saveDesign ../outputs/6_route.enc
###############################################################
current_design riscv_top
set_clock_gating_check -rise -setup 0 
set_clock_gating_check -fall -setup 0 
create_clock [get_ports {clk_i}]  -name clk -period 50.000000 -waveform {0.000000 25.000000}
set_propagated_clock  [get_ports {clk_i}]
#END OF CLOCK SECTION#
set_load -pin_load -max  0.05  [get_ports {alu_result_o[31]}]
set_load -pin_load -min  0.05  [get_ports {alu_result_o[31]}]
set_load -pin_load -max  0.05  [get_ports {alu_result_o[30]}]
set_load -pin_load -min  0.05  [get_ports {alu_result_o[30]}]
set_load -pin_load -max  0.05  [get_ports {alu_result_o[29]}]
set_load -pin_load -min  0.05  [get_ports {alu_result_o[29]}]
set_load -pin_load -max  0.05  [get_ports {alu_result_o[28]}]
set_load -pin_load -min  0.05  [get_ports {alu_result_o[28]}]
set_load -pin_load -max  0.05  [get_ports {alu_result_o[27]}]
set_load -pin_load -min  0.05  [get_ports {alu_result_o[27]}]
set_load -pin_load -max  0.05  [get_ports {alu_result_o[26]}]
set_load -pin_load -min  0.05  [get_ports {alu_result_o[26]}]
set_load -pin_load -max  0.05  [get_ports {alu_result_o[25]}]
set_load -pin_load -min  0.05  [get_ports {alu_result_o[25]}]
set_load -pin_load -max  0.05  [get_ports {alu_result_o[24]}]
set_load -pin_load -min  0.05  [get_ports {alu_result_o[24]}]
set_load -pin_load -max  0.05  [get_ports {alu_result_o[23]}]
set_load -pin_load -min  0.05  [get_ports {alu_result_o[23]}]
set_load -pin_load -max  0.05  [get_ports {alu_result_o[22]}]
set_load -pin_load -min  0.05  [get_ports {alu_result_o[22]}]
set_load -pin_load -max  0.05  [get_ports {alu_result_o[21]}]
set_load -pin_load -min  0.05  [get_ports {alu_result_o[21]}]
set_load -pin_load -max  0.05  [get_ports {alu_result_o[20]}]
set_load -pin_load -min  0.05  [get_ports {alu_result_o[20]}]
set_load -pin_load -max  0.05  [get_ports {alu_result_o[19]}]
set_load -pin_load -min  0.05  [get_ports {alu_result_o[19]}]
set_load -pin_load -max  0.05  [get_ports {alu_result_o[18]}]
set_load -pin_load -min  0.05  [get_ports {alu_result_o[18]}]
set_load -pin_load -max  0.05  [get_ports {alu_result_o[17]}]
set_load -pin_load -min  0.05  [get_ports {alu_result_o[17]}]
set_load -pin_load -max  0.05  [get_ports {alu_result_o[16]}]
set_load -pin_load -min  0.05  [get_ports {alu_result_o[16]}]
set_load -pin_load -max  0.05  [get_ports {alu_result_o[15]}]
set_load -pin_load -min  0.05  [get_ports {alu_result_o[15]}]
set_load -pin_load -max  0.05  [get_ports {alu_result_o[14]}]
set_load -pin_load -min  0.05  [get_ports {alu_result_o[14]}]
set_load -pin_load -max  0.05  [get_ports {alu_result_o[13]}]
set_load -pin_load -min  0.05  [get_ports {alu_result_o[13]}]
set_load -pin_load -max  0.05  [get_ports {alu_result_o[12]}]
set_load -pin_load -min  0.05  [get_ports {alu_result_o[12]}]
set_load -pin_load -max  0.05  [get_ports {alu_result_o[11]}]
set_load -pin_load -min  0.05  [get_ports {alu_result_o[11]}]
set_load -pin_load -max  0.05  [get_ports {alu_result_o[10]}]
set_load -pin_load -min  0.05  [get_ports {alu_result_o[10]}]
set_load -pin_load -max  0.05  [get_ports {alu_result_o[9]}]
set_load -pin_load -min  0.05  [get_ports {alu_result_o[9]}]
set_load -pin_load -max  0.05  [get_ports {alu_result_o[8]}]
set_load -pin_load -min  0.05  [get_ports {alu_result_o[8]}]
set_load -pin_load -max  0.05  [get_ports {alu_result_o[7]}]
set_load -pin_load -min  0.05  [get_ports {alu_result_o[7]}]
set_load -pin_load -max  0.05  [get_ports {alu_result_o[6]}]
set_load -pin_load -min  0.05  [get_ports {alu_result_o[6]}]
set_load -pin_load -max  0.05  [get_ports {alu_result_o[5]}]
set_load -pin_load -min  0.05  [get_ports {alu_result_o[5]}]
set_load -pin_load -max  0.05  [get_ports {alu_result_o[4]}]
set_load -pin_load -min  0.05  [get_ports {alu_result_o[4]}]
set_load -pin_load -max  0.05  [get_ports {alu_result_o[3]}]
set_load -pin_load -min  0.05  [get_ports {alu_result_o[3]}]
set_load -pin_load -max  0.05  [get_ports {alu_result_o[2]}]
set_load -pin_load -min  0.05  [get_ports {alu_result_o[2]}]
set_load -pin_load -max  0.05  [get_ports {alu_result_o[1]}]
set_load -pin_load -min  0.05  [get_ports {alu_result_o[1]}]
set_load -pin_load -max  0.05  [get_ports {alu_result_o[0]}]
set_load -pin_load -min  0.05  [get_ports {alu_result_o[0]}]
set_load -pin_load -max  0.05  [get_ports {zero_o}]
set_load -pin_load -min  0.05  [get_ports {zero_o}]
set_load -pin_load -max  0.05  [get_ports {neg_o}]
set_load -pin_load -min  0.05  [get_ports {neg_o}]
set_load -pin_load -max  0.05  [get_ports {overflow_o}]
set_load -pin_load -min  0.05  [get_ports {overflow_o}]
set_load -pin_load -max  0.05  [get_ports {carry_o}]
set_load -pin_load -min  0.05  [get_ports {carry_o}]
set_load -pin_load -max  0.05  [get_ports {dbg_data_o[31]}]
set_load -pin_load -min  0.05  [get_ports {dbg_data_o[31]}]
set_load -pin_load -max  0.05  [get_ports {dbg_data_o[30]}]
set_load -pin_load -min  0.05  [get_ports {dbg_data_o[30]}]
set_load -pin_load -max  0.05  [get_ports {dbg_data_o[29]}]
set_load -pin_load -min  0.05  [get_ports {dbg_data_o[29]}]
set_load -pin_load -max  0.05  [get_ports {dbg_data_o[28]}]
set_load -pin_load -min  0.05  [get_ports {dbg_data_o[28]}]
set_load -pin_load -max  0.05  [get_ports {dbg_data_o[27]}]
set_load -pin_load -min  0.05  [get_ports {dbg_data_o[27]}]
set_load -pin_load -max  0.05  [get_ports {dbg_data_o[26]}]
set_load -pin_load -min  0.05  [get_ports {dbg_data_o[26]}]
set_load -pin_load -max  0.05  [get_ports {dbg_data_o[25]}]
set_load -pin_load -min  0.05  [get_ports {dbg_data_o[25]}]
set_load -pin_load -max  0.05  [get_ports {dbg_data_o[24]}]
set_load -pin_load -min  0.05  [get_ports {dbg_data_o[24]}]
set_load -pin_load -max  0.05  [get_ports {dbg_data_o[23]}]
set_load -pin_load -min  0.05  [get_ports {dbg_data_o[23]}]
set_load -pin_load -max  0.05  [get_ports {dbg_data_o[22]}]
set_load -pin_load -min  0.05  [get_ports {dbg_data_o[22]}]
set_load -pin_load -max  0.05  [get_ports {dbg_data_o[21]}]
set_load -pin_load -min  0.05  [get_ports {dbg_data_o[21]}]
set_load -pin_load -max  0.05  [get_ports {dbg_data_o[20]}]
set_load -pin_load -min  0.05  [get_ports {dbg_data_o[20]}]
set_load -pin_load -max  0.05  [get_ports {dbg_data_o[19]}]
set_load -pin_load -min  0.05  [get_ports {dbg_data_o[19]}]
set_load -pin_load -max  0.05  [get_ports {dbg_data_o[18]}]
set_load -pin_load -min  0.05  [get_ports {dbg_data_o[18]}]
set_load -pin_load -max  0.05  [get_ports {dbg_data_o[17]}]
set_load -pin_load -min  0.05  [get_ports {dbg_data_o[17]}]
set_load -pin_load -max  0.05  [get_ports {dbg_data_o[16]}]
set_load -pin_load -min  0.05  [get_ports {dbg_data_o[16]}]
set_load -pin_load -max  0.05  [get_ports {dbg_data_o[15]}]
set_load -pin_load -min  0.05  [get_ports {dbg_data_o[15]}]
set_load -pin_load -max  0.05  [get_ports {dbg_data_o[14]}]
set_load -pin_load -min  0.05  [get_ports {dbg_data_o[14]}]
set_load -pin_load -max  0.05  [get_ports {dbg_data_o[13]}]
set_load -pin_load -min  0.05  [get_ports {dbg_data_o[13]}]
set_load -pin_load -max  0.05  [get_ports {dbg_data_o[12]}]
set_load -pin_load -min  0.05  [get_ports {dbg_data_o[12]}]
set_load -pin_load -max  0.05  [get_ports {dbg_data_o[11]}]
set_load -pin_load -min  0.05  [get_ports {dbg_data_o[11]}]
set_load -pin_load -max  0.05  [get_ports {dbg_data_o[10]}]
set_load -pin_load -min  0.05  [get_ports {dbg_data_o[10]}]
set_load -pin_load -max  0.05  [get_ports {dbg_data_o[9]}]
set_load -pin_load -min  0.05  [get_ports {dbg_data_o[9]}]
set_load -pin_load -max  0.05  [get_ports {dbg_data_o[8]}]
set_load -pin_load -min  0.05  [get_ports {dbg_data_o[8]}]
set_load -pin_load -max  0.05  [get_ports {dbg_data_o[7]}]
set_load -pin_load -min  0.05  [get_ports {dbg_data_o[7]}]
set_load -pin_load -max  0.05  [get_ports {dbg_data_o[6]}]
set_load -pin_load -min  0.05  [get_ports {dbg_data_o[6]}]
set_load -pin_load -max  0.05  [get_ports {dbg_data_o[5]}]
set_load -pin_load -min  0.05  [get_ports {dbg_data_o[5]}]
set_load -pin_load -max  0.05  [get_ports {dbg_data_o[4]}]
set_load -pin_load -min  0.05  [get_ports {dbg_data_o[4]}]
set_load -pin_load -max  0.05  [get_ports {dbg_data_o[3]}]
set_load -pin_load -min  0.05  [get_ports {dbg_data_o[3]}]
set_load -pin_load -max  0.05  [get_ports {dbg_data_o[2]}]
set_load -pin_load -min  0.05  [get_ports {dbg_data_o[2]}]
set_load -pin_load -max  0.05  [get_ports {dbg_data_o[1]}]
set_load -pin_load -min  0.05  [get_ports {dbg_data_o[1]}]
set_load -pin_load -max  0.05  [get_ports {dbg_data_o[0]}]
set_load -pin_load -min  0.05  [get_ports {dbg_data_o[0]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {alu_op_i[1]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {rd_addr_i[2]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {imm_i[28]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {rs1_addr_i[2]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {imm_i[1]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {dbg_addr_i[2]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {imm_i[12]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {rs2_addr_i[4]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {imm_i[6]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {imm_i[31]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {imm_i[24]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {imm_i[17]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {alu_op_i[2]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {rd_addr_i[3]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {imm_i[29]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {rs1_addr_i[3]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {rs2_addr_i[0]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {imm_i[2]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {dbg_addr_i[3]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {imm_i[20]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {imm_i[13]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {rst_ni}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {we_i}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {imm_i[7]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {imm_i[25]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {imm_i[18]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {alu_op_i[3]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {rd_addr_i[4]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {alu_src_b_i}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {rs1_addr_i[4]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {rs2_addr_i[1]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {imm_i[3]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {dbg_addr_i[4]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {imm_i[21]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {imm_i[14]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {rd_addr_i[0]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {imm_i[8]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {imm_i[26]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {imm_i[19]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {rs1_addr_i[0]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {dbg_addr_i[0]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {imm_i[10]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {rs2_addr_i[2]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {imm_i[4]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {imm_i[22]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {imm_i[15]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {alu_op_i[0]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {rd_addr_i[1]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {imm_i[9]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {imm_i[27]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {rs1_addr_i[1]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {imm_i[0]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {dbg_addr_i[1]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {imm_i[11]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {rs2_addr_i[3]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {imm_i[5]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {imm_i[30]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {imm_i[23]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {imm_i[16]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {dbg_data_o[28]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {alu_result_o[26]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {alu_result_o[19]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {dbg_data_o[12]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {alu_result_o[10]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {dbg_data_o[1]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {alu_result_o[8]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {dbg_data_o[31]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {dbg_data_o[24]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {dbg_data_o[17]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {alu_result_o[22]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {alu_result_o[15]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {dbg_data_o[6]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {alu_result_o[4]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {dbg_data_o[29]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {alu_result_o[27]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {dbg_data_o[20]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {dbg_data_o[13]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {alu_result_o[11]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {dbg_data_o[2]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {alu_result_o[9]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {carry_o}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {alu_result_o[0]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {dbg_data_o[25]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {dbg_data_o[18]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {zero_o}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {alu_result_o[30]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {alu_result_o[23]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {alu_result_o[16]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {dbg_data_o[7]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {alu_result_o[5]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {alu_result_o[28]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {dbg_data_o[21]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {dbg_data_o[14]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {alu_result_o[12]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {dbg_data_o[3]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {alu_result_o[1]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {neg_o}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {dbg_data_o[26]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {dbg_data_o[19]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {alu_result_o[31]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {alu_result_o[24]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {alu_result_o[17]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {dbg_data_o[10]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {dbg_data_o[8]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {alu_result_o[6]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {alu_result_o[29]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {dbg_data_o[22]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {dbg_data_o[15]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {alu_result_o[20]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {alu_result_o[13]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {dbg_data_o[4]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {alu_result_o[2]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {dbg_data_o[27]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {alu_result_o[25]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {alu_result_o[18]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {dbg_data_o[11]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {dbg_data_o[9]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {dbg_data_o[0]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {alu_result_o[7]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {dbg_data_o[30]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {dbg_data_o[23]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {dbg_data_o[16]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {alu_result_o[21]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {alu_result_o[14]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {dbg_data_o[5]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {alu_result_o[3]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {overflow_o}]
